#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.client_mig.data.google_compute_zones.available: Refreshing state...
data.google_compute_image.hashistack: Refreshing state...
module.server_mig.data.google_compute_zones.available: Refreshing state...
data.google_compute_zones.available: Refreshing state...
module.server_instance_template.data.google_compute_image.image_family: Refreshing state...
module.server_instance_template.data.google_compute_image.image: Refreshing state...
module.client_instance_template.data.google_compute_image.image: Refreshing state...
module.client_instance_template.data.google_compute_image.image_family: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_compute_firewall.allow-ingress-from-iap will be created
  + resource "google_compute_firewall" "allow-ingress-from-iap" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-ingress-from-iap"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]

      + allow {
          + ports    = [
              + "22",
              + "3389",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.consul-http will be created
  + resource "google_compute_firewall" "consul-http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "consul-http"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "ucontex-app"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "8500",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.fabio-lb-http will be created
  + resource "google_compute_firewall" "fabio-lb-http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "fabio-lb-http"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "ucontex-app"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "9998",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.internal will be created
  + resource "google_compute_firewall" "internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "internal"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.6.0.0/16",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "udp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_firewall.nomad-http will be created
  + resource "google_compute_firewall" "nomad-http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "nomad-http"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "ucontex-app"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "4646",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.services_endpoint will be created
  + resource "google_compute_firewall" "services_endpoint" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "external"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "ucontex-app"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.vault-http will be created
  + resource "google_compute_firewall" "vault-http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "vault-http"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "ucontex-app"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "8200",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_target_pool.client will be created
  + resource "google_compute_target_pool" "client" {
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_compute_target_pool.server will be created
  + resource "google_compute_target_pool" "server" {
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # random_string.name will be created
  + resource "random_string" "name" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.client_instance_template.google_compute_instance_template.tpl will be created
  + resource "google_compute_instance_template" "tpl" {
      + can_ip_forward          = false
      + id                      = (known after apply)
      + machine_type            = "n1-standard-1"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            #!/bin/bash
            
            set -xe
            
            PUBLIC_IP=$(curl -L http://metadata.google.internal/computeMetadata/v1/instance/network-interfaces/0/access-configs/0/external-ip -H "Metadata-Flavor:Google")
            PRIVATE_IP=$(curl -L http://metadata.google.internal/computeMetadata/v1/instance/network-interfaces/0/ip -H "Metadata-Flavor:Google")
            export VAULT_TOKEN=vault
            export VAULT_ADDR="http://localhost:8200"
            
            function configConsul() {
            	(
            		cat <<-EOF
            			datacenter = "us-central1"
            			data_dir   = "/opt/consul/data"
            			log_level  = "DEBUG"
            
            			bind_addr          = "0.0.0.0"
            			advertise_addr     = "$PRIVATE_IP"
            			advertise_addr_wan = "$PRIVATE_IP"
            
            			bootstrap_expect   = 1
            			client_addr = "0.0.0.0"
            			server      = true
            			ui          = true
            
            			retry_join = [
            			"provider=gce project_name=ucontex-app tag_value=autojoin"
            			]
            
            			raft_protocol = 3
            
            			autopilot {
            			cleanup_dead_servers      = true
            			last_contact_threshold    = "200ms"
            			max_trailing_logs         = 250
            			server_stabilization_time = "10s"
            			}
            
            			connect {
            			enabled = true
            			}
            
            			ports {}
            		EOF
            	) | sudo tee /etc/consul.d/consul.hcl
            
            	(
            		cat <<-EOF
            			[Unit]
            			Description=consul agent
            			Requires=network-online.target
            			After=network-online.target
            
            			[Service]
            			Restart=on-failure
            			ExecStart=/usr/local/bin/consul agent -config-dir=/etc/consul.d
            			ExecReload=/bin/kill -HUP $MAINPID
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/consul.service
            
            	sudo systemctl enable consul
            	sudo systemctl start consul
            }
            
            function configVault() {
            	(
            		cat <<-EOF
            			[Unit]
            			Description=vault
            			Requires=network-online.target
            			After=network-online.target
            
            			[Service]
            			Restart=on-failure
            			ExecStart=/usr/local/bin/vault server -dev -dev-listen-address="0.0.0.0:8200" -dev-root-token-id="vault"
            			ExecReload=/bin/kill -HUP $MAINPID
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/vault.service
            
            	sudo systemctl enable vault
            	sudo systemctl start vault
            
            	# vault policy write rabbit /vagrant/vault/rabbit-policy.hcl
            	# vault policy write nomad-server /vagrant/vault/nomad-server-policy.hcl
            	# vault write auth/token/roles/nomad-cluster @/vagrant/vault/nomad-cluster-role.json
            
            	vault_token=$(vault token create -policy nomad-server -period 72h -orphan -field=token)
            
            	# domain="mshome.net"
            	# vault secrets enable pki
            	# vault secrets tune -max-lease-ttl=87600h pki
            
            	# vault write -field=certificate pki/root/generate/internal common_name="$domain" ttl=87600h \
            	#     > /vagrant/vault/mshome.crt
            
            	# vault write pki/config/urls \
            	#     issuing_certificates="$VAULT_ADDR/v1/pki/ca" \
            	#     crl_distribution_points="$VAULT_ADDR/v1/pki/crl"
            
            	# vault write pki/roles/rabbit \
            	#     allowed_domains="$domain" \
            	#     allow_subdomains=true \
            	#     generate_lease=true \
            	#     max_ttl="720h"
            }
            
            function configNomad() {
            	(
            		cat <<-EOF
            			data_dir   = "/opt/nomad/data"
            			datacenter = "us-central1"
            			region     = "us-central1"
            
            			bind_addr = "0.0.0.0"
            			log_level = "DEBUG"
            
            			advertise {
            			http = "$PRIVATE_IP"
            			rpc  = "$PRIVATE_IP"
            			serf = "$PRIVATE_IP"
            			}
            
            			server {
            			enabled          = true
            			bootstrap_expect = "1"
            			}
            
            			client {
            			enabled       = true
            			network_speed = 10
            			}
            
            			consul {
            			address          = "127.0.0.1:8500"
            			auto_advertise   = true
            			server_auto_join = true
            			client_auto_join = true
            			}
            
            			vault {
            			enabled          = true
            			address          = "$VAULT_ADDR"
            			task_token_ttl   = "1h"
            			create_from_role = "nomad-cluster"
            			token            = "$vault_token"
            			}
            
            		EOF
            	) | sudo tee /etc/nomad.d/nomad.hcl
            
            	(
            		cat <<-EOF
            			[Unit]
            			Description=Nomad
            			Documentation=https://nomadproject.io/docs/
            			Wants=network-online.target
            			After=network-online.target
            
            			[Service]
            			ExecReload=/bin/kill -HUP $MAINPID
            			ExecStart=/usr/local/bin/nomad agent -config /etc/nomad.d
            			KillMode=process
            			KillSignal=SIGINT
            			LimitNOFILE=infinity
            			LimitNPROC=infinity
            			Restart=on-failure
            			RestartSec=2
            			StartLimitBurst=3
            			StartLimitIntervalSec=10
            			TasksMax=infinity
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/nomad.service
            
            	sudo systemctl enable nomad
            	sudo systemctl start nomad
            }
            
            function run() {
            	# configure consul server
            	configConsul
            
            	# # configure vault server
            	configVault
            
            	sleep 5
            
            	# configure nomad server
            	configNomad
            
            	sleep 5
            }
            
            # run setup instructions
            run
            sudo systemctl daemon-reload
        EOT
      + name                    = (known after apply)
      + name_prefix             = "nomad-client-template-staging-"
      + project                 = "ucontex-app"
      + region                  = "us-central1"
      + self_link               = (known after apply)
      + tags                    = [
          + "autojoin",
        ]
      + tags_fingerprint        = (known after apply)

      + disk {
          + auto_delete  = true
          + boot         = true
          + device_name  = (known after apply)
          + disk_size_gb = 50
          + disk_type    = "pd-standard"
          + interface    = (known after apply)
          + mode         = (known after apply)
          + source_image = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/images/hashistack"
          + type         = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip                 = (known after apply)
              + network_tier           = (known after apply)
              + public_ptr_domain_name = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = (known after apply)
          + preemptible         = false
        }

      + service_account {
          + email = "terraform@ucontex-app.iam.gserviceaccount.com"
        }
    }

  # module.client_mig.google_compute_region_instance_group_manager.mig will be created
  + resource "google_compute_region_instance_group_manager" "mig" {
      + base_instance_name        = (known after apply)
      + distribution_policy_zones = [
          + "us-central1-a",
          + "us-central1-b",
          + "us-central1-c",
          + "us-central1-f",
        ]
      + fingerprint               = (known after apply)
      + id                        = (known after apply)
      + instance_group            = (known after apply)
      + name                      = (known after apply)
      + project                   = "ucontex-app"
      + region                    = "us-central1"
      + self_link                 = (known after apply)
      + target_pools              = (known after apply)
      + target_size               = 1
      + wait_for_instances        = false

      + timeouts {
          + create = "5m"
          + delete = "15m"
          + update = "5m"
        }

      + update_policy {
          + instance_redistribution_type = (known after apply)
          + max_surge_fixed              = (known after apply)
          + max_surge_percent            = (known after apply)
          + max_unavailable_fixed        = (known after apply)
          + max_unavailable_percent      = (known after apply)
          + min_ready_sec                = (known after apply)
          + minimal_action               = (known after apply)
          + type                         = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
          + name              = (known after apply)
        }
    }

  # module.server_instance_template.google_compute_instance_template.tpl will be created
  + resource "google_compute_instance_template" "tpl" {
      + can_ip_forward          = false
      + id                      = (known after apply)
      + machine_type            = "n1-standard-1"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            #!/bin/bash
            
            set -xe
            
            PUBLIC_IP=$(curl -L http://metadata.google.internal/computeMetadata/v1/instance/network-interfaces/0/access-configs/0/external-ip -H "Metadata-Flavor:Google")
            PRIVATE_IP=$(curl -L http://metadata.google.internal/computeMetadata/v1/instance/network-interfaces/0/ip -H "Metadata-Flavor:Google")
            export VAULT_TOKEN=vault
            export VAULT_ADDR="http://localhost:8200"
            
            function configConsul() {
            	(
            		cat <<-EOF
            			datacenter = "us-central1"
            			data_dir   = "/opt/consul/data"
            			log_level  = "DEBUG"
            
            			bind_addr          = "0.0.0.0"
            			advertise_addr     = "$PRIVATE_IP"
            			advertise_addr_wan = "$PRIVATE_IP"
            
            			bootstrap_expect   = 1
            			client_addr = "0.0.0.0"
            			server      = true
            			ui          = true
            
            			retry_join = [
            			"provider=gce project_name=ucontex-app tag_value=autojoin"
            			]
            
            			raft_protocol = 3
            
            			autopilot {
            			cleanup_dead_servers      = true
            			last_contact_threshold    = "200ms"
            			max_trailing_logs         = 250
            			server_stabilization_time = "10s"
            			}
            
            			connect {
            			enabled = true
            			}
            
            			ports {}
            		EOF
            	) | sudo tee /etc/consul.d/consul.hcl
            
            	(
            		cat <<-EOF
            			[Unit]
            			Description=consul agent
            			Requires=network-online.target
            			After=network-online.target
            
            			[Service]
            			Restart=on-failure
            			ExecStart=/usr/local/bin/consul agent -config-dir=/etc/consul.d
            			ExecReload=/bin/kill -HUP $MAINPID
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/consul.service
            
            	sudo systemctl enable consul
            	sudo systemctl start consul
            }
            
            function configVault() {
            	(
            		cat <<-EOF
            			[Unit]
            			Description=vault
            			Requires=network-online.target
            			After=network-online.target
            
            			[Service]
            			Restart=on-failure
            			ExecStart=/usr/local/bin/vault server -dev -dev-listen-address="0.0.0.0:8200" -dev-root-token-id="vault"
            			ExecReload=/bin/kill -HUP $MAINPID
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/vault.service
            
            	sudo systemctl enable vault
            	sudo systemctl start vault
            
            	# vault policy write rabbit /vagrant/vault/rabbit-policy.hcl
            	# vault policy write nomad-server /vagrant/vault/nomad-server-policy.hcl
            	# vault write auth/token/roles/nomad-cluster @/vagrant/vault/nomad-cluster-role.json
            
            	vault_token=$(vault token create -policy nomad-server -period 72h -orphan -field=token)
            
            	# domain="mshome.net"
            	# vault secrets enable pki
            	# vault secrets tune -max-lease-ttl=87600h pki
            
            	# vault write -field=certificate pki/root/generate/internal common_name="$domain" ttl=87600h \
            	#     > /vagrant/vault/mshome.crt
            
            	# vault write pki/config/urls \
            	#     issuing_certificates="$VAULT_ADDR/v1/pki/ca" \
            	#     crl_distribution_points="$VAULT_ADDR/v1/pki/crl"
            
            	# vault write pki/roles/rabbit \
            	#     allowed_domains="$domain" \
            	#     allow_subdomains=true \
            	#     generate_lease=true \
            	#     max_ttl="720h"
            }
            
            function configNomad() {
            	(
            		cat <<-EOF
            			data_dir   = "/opt/nomad/data"
            			datacenter = "us-central1"
            			region     = "us-central1"
            
            			bind_addr = "0.0.0.0"
            			log_level = "DEBUG"
            
            			advertise {
            			http = "$PRIVATE_IP"
            			rpc  = "$PRIVATE_IP"
            			serf = "$PRIVATE_IP"
            			}
            
            			server {
            			enabled          = true
            			bootstrap_expect = "1"
            			}
            
            			client {
            			enabled       = true
            			network_speed = 10
            			}
            
            			consul {
            			address          = "127.0.0.1:8500"
            			auto_advertise   = true
            			server_auto_join = true
            			client_auto_join = true
            			}
            
            			vault {
            			enabled          = true
            			address          = "$VAULT_ADDR"
            			task_token_ttl   = "1h"
            			create_from_role = "nomad-cluster"
            			token            = "$vault_token"
            			}
            
            		EOF
            	) | sudo tee /etc/nomad.d/nomad.hcl
            
            	(
            		cat <<-EOF
            			[Unit]
            			Description=Nomad
            			Documentation=https://nomadproject.io/docs/
            			Wants=network-online.target
            			After=network-online.target
            
            			[Service]
            			ExecReload=/bin/kill -HUP $MAINPID
            			ExecStart=/usr/local/bin/nomad agent -config /etc/nomad.d
            			KillMode=process
            			KillSignal=SIGINT
            			LimitNOFILE=infinity
            			LimitNPROC=infinity
            			Restart=on-failure
            			RestartSec=2
            			StartLimitBurst=3
            			StartLimitIntervalSec=10
            			TasksMax=infinity
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/nomad.service
            
            	sudo systemctl enable nomad
            	sudo systemctl start nomad
            }
            
            function run() {
            	# configure consul server
            	configConsul
            
            	# # configure vault server
            	configVault
            
            	sleep 5
            
            	# configure nomad server
            	configNomad
            
            	sleep 5
            }
            
            # run setup instructions
            run
            sudo systemctl daemon-reload
        EOT
      + name                    = (known after apply)
      + name_prefix             = "nomad-server-template-staging-"
      + project                 = "ucontex-app"
      + region                  = "us-central1"
      + self_link               = (known after apply)
      + tags                    = [
          + "autojoin",
        ]
      + tags_fingerprint        = (known after apply)

      + disk {
          + auto_delete  = true
          + boot         = true
          + device_name  = (known after apply)
          + disk_size_gb = 50
          + disk_type    = "pd-standard"
          + interface    = (known after apply)
          + mode         = (known after apply)
          + source_image = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/images/hashistack"
          + type         = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip                 = (known after apply)
              + network_tier           = (known after apply)
              + public_ptr_domain_name = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = (known after apply)
          + preemptible         = false
        }

      + service_account {
          + email = "terraform@ucontex-app.iam.gserviceaccount.com"
        }
    }

  # module.server_mig.google_compute_region_instance_group_manager.mig will be created
  + resource "google_compute_region_instance_group_manager" "mig" {
      + base_instance_name        = (known after apply)
      + distribution_policy_zones = [
          + "us-central1-a",
          + "us-central1-b",
          + "us-central1-c",
          + "us-central1-f",
        ]
      + fingerprint               = (known after apply)
      + id                        = (known after apply)
      + instance_group            = (known after apply)
      + name                      = (known after apply)
      + project                   = "ucontex-app"
      + region                    = "us-central1"
      + self_link                 = (known after apply)
      + target_pools              = (known after apply)
      + target_size               = 1
      + wait_for_instances        = false

      + timeouts {
          + create = "5m"
          + delete = "15m"
          + update = "5m"
        }

      + update_policy {
          + instance_redistribution_type = (known after apply)
          + max_surge_fixed              = (known after apply)
          + max_surge_percent            = (known after apply)
          + max_unavailable_fixed        = (known after apply)
          + max_unavailable_percent      = (known after apply)
          + min_ready_sec                = (known after apply)
          + minimal_action               = (known after apply)
          + type                         = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
          + name              = (known after apply)
        }
    }

  # module.vpc_network.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = (known after apply)
      + project                         = "ucontex-app"
      + routing_mode                    = "REGIONAL"
      + self_link                       = (known after apply)
    }

  # module.vpc_network.google_compute_router.vpc_router will be created
  + resource "google_compute_router" "vpc_router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = (known after apply)
      + project            = "ucontex-app"
      + region             = "us-central1"
      + self_link          = (known after apply)
    }

  # module.vpc_network.google_compute_router_nat.vpc_nat will be created
  + resource "google_compute_router_nat" "vpc_nat" {
      + icmp_idle_timeout_sec              = 30
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + nat_ip_allocate_option             = "AUTO_ONLY"
      + project                            = "ucontex-app"
      + region                             = "us-central1"
      + router                             = (known after apply)
      + source_subnetwork_ip_ranges_to_nat = "LIST_OF_SUBNETWORKS"
      + tcp_established_idle_timeout_sec   = 1200
      + tcp_transitory_idle_timeout_sec    = 30
      + udp_idle_timeout_sec               = 30

      + subnetwork {
          + name                     = (known after apply)
          + secondary_ip_range_names = []
          + source_ip_ranges_to_nat  = [
              + "ALL_IP_RANGES",
            ]
        }
    }

  # module.vpc_network.google_compute_subnetwork.vpc_subnetwork_private will be created
  + resource "google_compute_subnetwork" "vpc_subnetwork_private" {
      + creation_timestamp       = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.6.16.0/20"
      + name                     = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = true
      + project                  = "ucontex-app"
      + region                   = "us-central1"
      + secondary_ip_range       = [
          + {
              + ip_cidr_range = "10.7.16.0/20"
              + range_name    = "private-services"
            },
        ]
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_10_MIN"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc_network.google_compute_subnetwork.vpc_subnetwork_public will be created
  + resource "google_compute_subnetwork" "vpc_subnetwork_public" {
      + creation_timestamp       = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.6.0.0/20"
      + name                     = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = true
      + project                  = "ucontex-app"
      + region                   = "us-central1"
      + secondary_ip_range       = [
          + {
              + ip_cidr_range = "10.7.0.0/20"
              + range_name    = "public-services"
            },
        ]
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_10_MIN"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc_network.module.network_firewall.data.google_compute_subnetwork.private_subnetwork will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_subnetwork" "private_subnetwork"  {
      + description              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = (known after apply)
      + project                  = (known after apply)
      + region                   = (known after apply)
      + secondary_ip_range       = (known after apply)
      + self_link                = (known after apply)
    }

  # module.vpc_network.module.network_firewall.data.google_compute_subnetwork.public_subnetwork will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_subnetwork" "public_subnetwork"  {
      + description              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = (known after apply)
      + project                  = (known after apply)
      + region                   = (known after apply)
      + secondary_ip_range       = (known after apply)
      + self_link                = (known after apply)
    }

  # module.vpc_network.module.network_firewall.google_compute_firewall.private_allow_all_network_inbound will be created
  + resource "google_compute_firewall" "private_allow_all_network_inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = (known after apply)
      + priority           = 1000
      + project            = "ucontex-app"
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "private",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.vpc_network.module.network_firewall.google_compute_firewall.private_allow_restricted_network_inbound will be created
  + resource "google_compute_firewall" "private_allow_restricted_network_inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = (known after apply)
      + priority           = 1000
      + project            = "ucontex-app"
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + source_tags        = [
          + "private",
          + "private-persistence",
        ]
      + target_tags        = [
          + "private-persistence",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.vpc_network.module.network_firewall.google_compute_firewall.public_allow_all_inbound will be created
  + resource "google_compute_firewall" "public_allow_all_inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = (known after apply)
      + priority           = 1000
      + project            = "ucontex-app"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "public",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + avaliable_compute_zones = {
      + id      = "projects/ucontex-app/regions/us-central1"
      + names   = [
          + "us-central1-a",
          + "us-central1-b",
          + "us-central1-c",
          + "us-central1-f",
        ]
      + project = "ucontex-app"
      + region  = "us-central1"
      + status  = null
    }
  + network                 = (known after apply)
  + vpc_id                  = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @IkeChukwuanu, Action: `pull_request`, Working Directory: ``, Workflow: `Staging - Provision Infra`*